/* Localizable strings not stored in nib files and not stored in application resources, */
/* the strings below can be accessed using the GetBundleLocalizedString() macro, those */
/* stored in application resources must be accessed using GetLocalizedString() instead. */

"kNoStartDateNotRunning" = "Not available - Service is not running";

"kDateFormatter" = "%c";

"RUNNING" = "Running";

"STOPPED" = "Stopped";

"STARTING" = "Starting up";

"STOPPING" = "Shutting down";

"PAUSED" = "Paused";

"UNKNOWN" = "Unknown";

"N/A" = "Not available";

"kCannotAcceptChangesAlertTtl" = "Cannot accept changes";

"kEditedRecordWasNotFoundAlertTtl" = "Can no longer edit record";

"kEditedRecordWasNotFoundAlertMsg" = "The selected record could not be retrieved. Going back to the list.";

"kInvalidEmptyEntry" = "Entry should not be empty.";

"kCancelButton" = "Cancel";

"kDeleteButton" = "Delete";

"kBeforeSavingConfirmationMessage" = "Are you sure you want to save now?";

"kBeforeAbortingSaveConfirmationMessage" = "Are you sure you want to abort the save operation now?";

"NEW_STORAGE_LOCATION_SHEET" = "Choose a folder where you would like to store controller data.";

/* agent status */

"Working" = "Working";

"Unavailable" = "Unavailable";

"Available" = "Available";

/* individual service status */

"Running" = "Running";

"Stopped" = "Stopped";

/* Authentication help */

"AgentController-Password-help" = "The controller must authenticate to this agent with the password above.";

"AgentController-Kerberos-help" = "The controller must authenticate to this agent using Kerberos (Single Sign On).";

"AgentController-None-help" = "The controller is not required to authenticate to this agent.";

"ControllerAgent-Password-help" = "The controller will authenticate to agents with the password above.";

"ControllerAgent-Kerberos-help" = "The controller will authenticate to agents using Kerberos (Single Sign On).";

"ControllerAgent-Any-help" = "The controller will authenticate to agents using either the password above or Kerberos (Single Sign on) as required by the agent.";

"ControllerAgent-None-help" = "The controller will not authenticate to agents.";

"ControllerClient-Password-help" = "Clients must authenticate to the controller using the password above.";

"ControllerClient-Kerberos-help" = "Clients must authenticate to the controller using Kerberos (Single Sign On).";

"ControllerClient-None-help" = "Clients are not required to authenticate to the controller.";

/* Most common errors (server-side) */

"100001" = "could not set flag"; /* CANNOT_SET_DEMO_FLAG_ERR */

"100002" = "could not clear flag"; /* CANNOT_CLEAR_DEMO_FLAG_ERR */

"100003" = "unexpected file format"; /* UNEXPECTED_XGRID_RECORD_FORMAT_ERR */

"100004" = "could not create record"; /* COULD_NOT_CREATE_XGRID_RECORD_ERR */

"100005" = "could not modify record"; /* COULD_NOT_MODIFY_XGRID_RECORD_ERR */

"100006" = "could not delete record"; /* COULD_NOT_DELETE_XGRID_RECORD_ERR */

"100007" = "record was deleted in the meanwhile"; /* XGRID_RECORD_WAS_DELETED_ERR */

"100008" = "record was created in the meanwhile"; /* XGRID_RECORD_WAS_CREATED_ERR */

"100009" = "could not find user name and password"; /* COULD_NOT_FIND_CREDENTIALS_ERR */		

"100010" = "unexpected user name or password"; /* UNEXPECTED_CREDENTIALS_ERR */			

/* Most common errors (client-side) */
"controllerpasswordempty" = "You have selected type of Password for Controller Authentication, please enter password";
"clientpasswordempty"     = "You have selected type of Password for Client Authentication, please enter password";
"agentpasswordempty"      = "You have selected type of Password for Agent Authentication, please enter password";
"Xgrid Service is not configured." = "Xgrid Service is not configured.";
"Controller or agent must be enabled before starting the service." = "Controller or agent must be enabled before starting the service.";


/* Summary Banner */
"no controllerBanner" = "No controller running";
"yes controllerBanner" = " working CPU power";
"no agentBanner" = "Agent not controlled";
"yes agentBanner" = "Agent controlled by ";

/* Overview */

"Xgrid Service is:" = "Xgrid Service is:";
"Start Time:" = "Start Time:";

"Agent:" = "Agent:";
"Controlled By:" = "Controlled By:";
"Working:" = "Working:";
"Available:" = "Available:";
"Controller:" = "Controller:";
"Agents:" = "Agents:";
"Jobs Running:" = "Jobs Running:";
"Jobs Pending:" = "Jobs Pending:";

"Configure Xgrid Service..." = "Configure Xgrid Service…";

/* Logs */
"System Log (Xgrid)" = "System Log (Xgrid)";
"Console Log (Xgrid)" = "Console Log (Xgrid)";
"Xgrid Controller Log" = "Xgrid Controller Log";
"Xgrid Agent Log" = "Xgrid Agent Log";
